JuhoL/ASch/Hal_STM32F429ZI/tests/UTest_Hal_Clocks.cpp
//-----------------------------------------------------------------------------------------------------------------------------
// Copyright (c) 2019 Juho Lepistö
// 
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated
// documentation files (the "Software"), to deal in the Software without restriction, including without 
// limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
// the Software, and to permit persons to whom the Software is furnished to do so, subject to the following
// conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or substantial
// portions of the Software.
// 
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
// TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
// THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF
// CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
// IN THE SOFTWARE.
//-----------------------------------------------------------------------------------------------------------------------------

//! @file    UTest_Hal_Clocks.cpp
//! @author  Juho Lepistö juho.lepisto(a)gmail.com
//! @date    25 Jul 2019
//! 
//! @brief   These are unit tests for Hal_Clocks.cpp
//! 
//! These are unit tests for Hal_Clocks.cpp utilising Catch2 and FakeIt.

//-----------------------------------------------------------------------------------------------------------------------------
// 1. Include Files
//-----------------------------------------------------------------------------------------------------------------------------

#include <Catch_Utils.hpp>

#include <Hal_Clocks.hpp>
#include <Utils_Bit.hpp>
#include <stm32f429xx_mock.h>
#include <Utils_Assert_Mock.hpp>

#include <Hal_Internal_Mock.hpp>
#include <ASch_Configuration.hpp>

//-----------------------------------------------------------------------------------------------------------------------------
// 2. Test Structs and Variables
//-----------------------------------------------------------------------------------------------------------------------------

namespace
{

}

//-----------------------------------------------------------------------------------------------------------------------------
// 3. Test Cases
//-----------------------------------------------------------------------------------------------------------------------------

SCENARIO ("Clocks are enabled", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();
    HalMock::InitInternal();

    GIVEN ("HSI is disabled and clocks are functioning correctly")
    {
        // HSI is on by default, so disable it first.
        Utils::SetBit(RCC->CR, RCC_CR_HSIRDY_Pos, false);

        // This tells the HAL that the oscillator has started correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToSet, false);

        WHEN ("the HSI clock is enabled")
        {
            Hal::Clocks::Enable(Hal::OscillatorType::highSpeed_internal);

            THEN ("HSION bit in RCC CR register shall be set and HSIRDY bit shall be waited")
            {
                REQUIRE (Utils::GetBit(RCC->CR, RCC_CR_HSION_Pos) == true);
                REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToSet, RCC->CR, RCC_CR_HSIRDY_Pos);
            }
        }
    }

    GIVEN ("HSE is disabled and clocks are functioning correctly")
    {
        // This tells the HAL that the oscillator has started correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToSet, false);

        WHEN ("the HSE clock is enabled")
        {
            Hal::Clocks::Enable(Hal::OscillatorType::highSpeed_external);

            THEN ("HSEON bit in RCC CR register shall be set and HSERDY bit shall be waited")
            {
                REQUIRE (Utils::GetBit(RCC->CR, RCC_CR_HSEON_Pos) == true);
                REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToSet, RCC->CR, RCC_CR_HSERDY_Pos);
            }
        }
    }

    GIVEN ("LSI is disabled and clocks are functioning correctly")
    {
        // This tells the HAL that the oscillator has started correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToSet, false);

        WHEN ("the LSI clock is enabled")
        {
            Hal::Clocks::Enable(Hal::OscillatorType::lowSpeed_internal);

            THEN ("LSION bit in RCC CSR register shall be set and LSIRDY bit shall be waited")
            {
                REQUIRE (Utils::GetBit(RCC->CSR, RCC_CSR_LSION_Pos) == true);
                REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToSet, RCC->CSR, RCC_CSR_LSIRDY_Pos);
            }
        }
    }

    GIVEN ("LSE is disabled and clocks are functioning correctly")
    {
        // This tells the HAL that the oscillator has started correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToSet, false);

        WHEN ("the LSE clock is enabled")
        {
            Hal::Clocks::Enable(Hal::OscillatorType::lowSpeed_external);

            THEN ("LSEON bit in RCC BDCR register shall be set and LSERDY bit shall be waited")
            {
                REQUIRE (Utils::GetBit(RCC->BDCR, RCC_BDCR_LSEON_Pos) == true);
                REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToSet, RCC->BDCR, RCC_BDCR_LSERDY_Pos);
            }
        }
    }

    GIVEN ("the oscillators are already running")
    {
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);
        Utils::SetBit(RCC->CSR, RCC_CSR_LSIRDY_Pos, true);
        Utils::SetBit(RCC->BDCR, RCC_BDCR_LSERDY_Pos, true);

        WHEN ("the the clocks are enabled")
        {
            Hal::Clocks::Enable(Hal::OscillatorType::highSpeed_internal);
            Hal::Clocks::Enable(Hal::OscillatorType::highSpeed_external);
            Hal::Clocks::Enable(Hal::OscillatorType::lowSpeed_internal);
            Hal::Clocks::Enable(Hal::OscillatorType::lowSpeed_external);

            THEN ("no configurations shall occur")
            {
                REQUIRE_CALLS (0, HalMock::mockHalInternal, WaitForBitToSet);
            }
        }
    }
}

SCENARIO ("Clocks are disabled", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();
    HalMock::InitInternal();
    ASchMock::Assert::Init();

    GIVEN ("HSI is enabled and is not used as a system clock")
    {
        Utils::SetBit(RCC->CR, RCC_CR_HSIRDY_Pos, true);
        // HSE as system clock.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_0);

        // This tells the HAL that the oscillator has stopped correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToClear, false);

