JuhoL/ASch/Hal_STM32F429ZI/tests/UTest_Hal_Clocks.cpp
        WHEN ("PLL is enabled with source from non-running HSE and target of 120MHz")
        {
            Hal::Clocks::EnablePll(Hal::OscillatorType::highSpeed_external, Hal::MHz(120UL));

            THEN ("an assert failure shall trigger")
            {
                REQUIRE (ASchMock::Assert::GetFails() == 1UL);
            }
        }
    }
}

SCENARIO ("Clock status is read", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();

    GIVEN ("HSI is enabled")
    {
        // HSI is on by default

        WHEN ("the HSI status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::highSpeed_internal);

            THEN ("the check shall return true")
            {
                REQUIRE (isRunning == true);
            }
        }
    }

    GIVEN ("HSI is disabled")
    {
        // Disable HSI
        Utils::SetBit(RCC->CR, RCC_CR_HSIRDY_Pos, false);

        WHEN ("the HSI status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::highSpeed_internal);

            THEN ("the check shall return false")
            {
                REQUIRE (isRunning == false);
            }
        }
    }

    GIVEN ("HSE is enabled")
    {
        // Enable HSE
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);

        WHEN ("the HSE status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::highSpeed_external);

            THEN ("the check shall return true")
            {
                REQUIRE (isRunning == true);
            }
        }
    }

    GIVEN ("HSE is disabled")
    {
        // HSE is disabled by default

        WHEN ("the HSE status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::highSpeed_external);

            THEN ("the check shall return false")
            {
                REQUIRE (isRunning == false);
            }
        }
    }

    GIVEN ("LSI is enabled")
    {
        // Enable LSI
        Utils::SetBit(RCC->CSR, RCC_CSR_LSIRDY_Pos, true);

        WHEN ("the LSI status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::lowSpeed_internal);

            THEN ("the check shall return true")
            {
                REQUIRE (isRunning == true);
            }
        }
    }

    GIVEN ("LSI is disabled")
    {
        // LSI is disabled by default

        WHEN ("the LSI status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::lowSpeed_internal);

            THEN ("the check shall return false")
            {
                REQUIRE (isRunning == false);
            }
        }
    }

    GIVEN ("LSE is enabled")
    {
        // Enable LSE
        Utils::SetBit(RCC->BDCR, RCC_BDCR_LSERDY_Pos, true);

        WHEN ("the LSE status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::lowSpeed_external);

            THEN ("the check shall return true")
            {
                REQUIRE (isRunning == true);
            }
        }
    }

    GIVEN ("LSE is disabled")
    {
        // LSE is disabled by default

        WHEN ("the LSE status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::lowSpeed_external);

            THEN ("the check shall return false")
            {
                REQUIRE (isRunning == false);
            }
        }
    }

    GIVEN ("PLL is enabled")
    {
        // Enable PLL
        Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true);

        WHEN ("the PLL status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::pll);

            THEN ("the check shall return true")
            {
                REQUIRE (isRunning == true);
            }
        }
    }

    GIVEN ("PLL is disabled")
    {
        // PLL is disabled by default

        WHEN ("the PLL status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::pll);

            THEN ("the check shall return false")
            {
                REQUIRE (isRunning == false);
            }
        }
    }
}

SCENARIO ("Clock frequencies are written and read", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();
    ASchMock::Assert::Init();

    GIVEN ("HSI is enabled")
    {
        // HSI is on by default

        WHEN ("HSI frequency is read")
        {
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::highSpeed_internal);

            THEN ("frequency shall be 16MHz")
            {
                REQUIRE (frequency == Hal::MHz(16UL));

                AND_WHEN ("the HSI frequency is set to 10MHz and the HSI frequency is read")
                {
                    Hal::Clocks::SetFrequency(Hal::OscillatorType::highSpeed_internal, Hal::MHz(10UL));
                    frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::highSpeed_internal);

                    THEN ("the frequency shall still be 16MHz")
                    {
                        REQUIRE (frequency == Hal::MHz(16UL));
                    }
                }
            }
        }
    }

    GIVEN ("HSI is enabled")
    {
        // HSI is on by default

        WHEN ("the HSI frequency is set to 10MHz")
        {
            Hal::Clocks::SetFrequency(Hal::OscillatorType::highSpeed_internal, Hal::MHz(10UL));

            THEN ("an assert failure shall trigger")
            {
                REQUIRE (ASchMock::Assert::GetFails() == 1UL);
            }
        }
    }

    GIVEN ("HSE is enabled and its frequency is set to 24MHz")
    {
        // Enable HSE
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);
        Hal::Clocks::SetFrequency(Hal::OscillatorType::highSpeed_external, Hal::MHz(24UL));

        WHEN ("the HSE frequency is read")
        {
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::highSpeed_external);

            THEN ("frequency shall be 24MHz")
            {
                REQUIRE (frequency == Hal::MHz(24UL));
            }
        }
    }

    GIVEN ("HSE is disabled and its frequency is set to 24MHz")
    {
        // HSE is disabled by default.
        Hal::Clocks::SetFrequency(Hal::OscillatorType::highSpeed_external, Hal::MHz(24UL));

        WHEN ("the HSE frequency is read")
        {
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::highSpeed_external);

            THEN ("frequency shall be 0MHz")
            {
                REQUIRE (frequency == 0UL);
            }
        }
    }

    GIVEN ("PLL is enabled")
    {
        Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true);

        WHEN ("the PLL frequency is set to 100MHz")
        {
            Hal::Clocks::SetFrequency(Hal::OscillatorType::highSpeed_internal, Hal::MHz(100UL));

            THEN ("an assert failure shall trigger")
            {
                REQUIRE (ASchMock::Assert::GetFails() == 1UL);
            }
        }
    }

    GIVEN ("system is at init state")
    {
        WHEN ("the unknown frequency is read")
        {
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::unknown);

            THEN ("frequency shall be 0MHz")
            {
                REQUIRE (frequency == 0UL);
            }
        }
    }
}

SCENARIO ("System clock is selected", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();
    HalMock::InitInternal();

    GIVEN ("HSE is system clock and HSI is enabled")
    {
        // Set HSE as system clock
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_0);
        // HSI is enabled by default. No need to enable it again.
        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);
        // This tells the HAL that the system clock was changed successfully.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitPatternToSet, false);

