JuhoL/ASch/Hal_STM32F429ZI/tests/UTest_Hal_Clocks.cpp
        WHEN ("the HSI is set as system clock source")
        {
            Hal::Clocks::SetSysClockSource(Hal::OscillatorType::highSpeed_internal);

            THEN ("SWS bits in RCC CFGR register shall be set to 00 and corresponding SW bits shall be waited")
            {
                REQUIRE (Utils::CompareBits(RCC->CFGR, RCC_CFGR_SW_Msk, 0UL));
                REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitPatternToSet, RCC->CFGR, (uint32_t)RCC_CFGR_SWS_Msk, (uint32_t)0UL);
            }
        }
    }

    GIVEN ("HSE is enabled")
    {
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);

        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);
        // This tells the HAL that the system clock was changed successfully.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitPatternToSet, false);

        WHEN ("the HSI is set as system clock source")
        {
            Hal::Clocks::SetSysClockSource(Hal::OscillatorType::highSpeed_external);

            THEN ("SWS bits in RCC CFGR register shall be set to 01 and corresponding SW bits shall be waited")
            {
                REQUIRE (Utils::CompareBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_0));
                REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitPatternToSet, RCC->CFGR, (uint32_t)RCC_CFGR_SWS_Msk, (uint32_t)RCC_CFGR_SWS_0);
            }
        }
    }

    GIVEN ("PLL is enabled")
    {
        Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true);

        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);
        // This tells the HAL that the system clock was changed successfully.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitPatternToSet, false);

        WHEN ("the PLL is set as system clock source")
        {
            Hal::Clocks::SetSysClockSource(Hal::OscillatorType::pll);

            THEN ("SWS bits in RCC CFGR register shall be set to 10 and corresponding SW bits shall be waited")
            {
                REQUIRE (Utils::CompareBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_1));
                REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitPatternToSet, RCC->CFGR, (uint32_t)RCC_CFGR_SWS_Msk, (uint32_t)RCC_CFGR_SWS_1);
            }
        }
    }

    GIVEN ("HSE is system clock and HSI is disabled")
    {
        // Set HSE as system clock
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_0);
        // Disable HSI.
        Utils::SetBit(RCC->CR, RCC_CR_HSIRDY_Pos, false);
        
        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);
        // This tells the HAL that the system clock was changed successfully.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitPatternToSet, false);

        WHEN ("the HSI is set as system clock source")
        {
            Hal::Clocks::SetSysClockSource(Hal::OscillatorType::highSpeed_internal);

            THEN ("SWS bits in RCC CFGR register shall not be changed")
            {
                REQUIRE (Utils::CompareBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk));
                REQUIRE_CALLS (0, HalMock::mockHalInternal, WaitForBitPatternToSet);
            }
        }
    }

    GIVEN ("HSE is disabled")
    {
        // HSE is disabled by default.
        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);
        // This tells the HAL that the system clock was changed successfully.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitPatternToSet, false);

        WHEN ("the HSI is set as system clock source")
        {
            Hal::Clocks::SetSysClockSource(Hal::OscillatorType::highSpeed_external);

            THEN ("SWS bits in RCC CFGR register shall note be changed")
            {
                REQUIRE (Utils::CompareBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk));
                REQUIRE_CALLS (0, HalMock::mockHalInternal, WaitForBitPatternToSet);
            }
        }
    }

    GIVEN ("PLL is disabled")
    {
        // PLL is disabled by default.
        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);
        // This tells the HAL that the system clock was changed successfully.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitPatternToSet, false);

        WHEN ("the PLL is set as system clock source")
        {
            Hal::Clocks::SetSysClockSource(Hal::OscillatorType::pll);

            THEN ("SWS bits in RCC CFGR register shall note be changed")
            {
                REQUIRE (Utils::CompareBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk));
                REQUIRE_CALLS (0, HalMock::mockHalInternal, WaitForBitPatternToSet);
            }
        }
    }
}

SCENARIO ("System clock source is read", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();

    GIVEN ("HSI is system clock")
    {
        // HSI is system clock by default

        WHEN ("system clock source is read")
        {
            Hal::OscillatorType type = Hal::Clocks::GetSysClockSource();

            THEN ("the clock type shall be HSI")
            {
                REQUIRE (type == Hal::OscillatorType::highSpeed_internal);
            }
        }
    }

    GIVEN ("HSE is system clock")
    {
        // Set HSE as system clock
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_0);

        WHEN ("system clock source is read")
        {
            Hal::OscillatorType type = Hal::Clocks::GetSysClockSource();

            THEN ("the clock type shall be HSE")
            {
                REQUIRE (type == Hal::OscillatorType::highSpeed_external);
            }
        }
    }

    GIVEN ("PLL is system clock")
    {
        // Set PLL as system clock
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_1);

        WHEN ("system clock source is read")
        {
            Hal::OscillatorType type = Hal::Clocks::GetSysClockSource();

            THEN ("the clock type shall be PLL")
            {
                REQUIRE (type == Hal::OscillatorType::pll);
            }
        }
    }
}
